Revit 2027 API
BuiltInFailures.StairRampFailures.TooShortCurveDowngradeGeometry Property
 Curve is too short and may downgrade the geometry.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId TooShortCurveDowngradeGeometry { get; }
Public Shared ReadOnly Property TooShortCurveDowngradeGeometry As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ TooShortCurveDowngradeGeometry {
	FailureDefinitionId^ get ();
}
static member TooShortCurveDowngradeGeometry : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace